src/InformationRegisters/ит_ТорговыеТочки_Ответственные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ит_ТорговыеТочки_Ответственные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнженерТехПоддержки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительНаправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ит_ТорговыеТочки_Ответственные/Ext/ManagerModule.bsl
//возвращает структуру в виде СМ ЛМ для ТТ
Функция ПолучитьОтветственныхДляОбъекта(Ссылка,ТекДата) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ит_ТорговыеТочки_ОтветственныеСрезПоследних.СтМенеджер КАК СтаршийМенеджер,
	               |	ит_ТорговыеТочки_ОтветственныеСрезПоследних.Менеджер КАК ЛинейныйМенеджер,
	               |	МАКСИМУМ(ит_ТорговыеТочки_Ответственные.Период) КАК ДатаИстории
	               |ИЗ
	               |	РегистрСведений.ит_ТорговыеТочки_Ответственные.СрезПоследних(&ТекДата, ТорговаяТочка = &Ссылка) КАК ит_ТорговыеТочки_ОтветственныеСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ит_ТорговыеТочки_Ответственные КАК ит_ТорговыеТочки_Ответственные
	               |		ПО ит_ТорговыеТочки_ОтветственныеСрезПоследних.ТорговаяТочка = ит_ТорговыеТочки_Ответственные.ТорговаяТочка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ит_ТорговыеТочки_ОтветственныеСрезПоследних.СтМенеджер,
	               |	ит_ТорговыеТочки_ОтветственныеСрезПоследних.Менеджер";
				   
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("ТекДата",ТекДата);
	Рез = Запрос.Выполнить().Выбрать();
	СтруктураСЛМ = Новый Структура("СтаршийМенеджер,ЛинейныйМенеджер,ДатаИстории");
	Если Рез.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураСЛМ,Рез);
	КонецЕсли;
	
	Возврат СтруктураСЛМ;
	
КонецФункции
